In [1]:
# Pandas
# To complete this concept it may take 40 hours to understand completely
# but for ML, DL, we will discuss now

In [2]:
# Pandas is a Data analysis library
# Extensively used by Data Scientists and Data Analysts..
# Pandas are works over and above the basic fundamental library called Numpy
# basically Numpy works inside of pandas becuase basic opreations which are available in pandas for numerical operations like we have seen in nUMPY, CAN BE A limitation in Pandas, So always pandas goes with Numpy also
# Numpy should be installed along with Pandas for better performance of numberical operations

In [3]:
# In python need to deal with dataFrames then pandas is very important lib.

In [4]:
# For EDA, Pandas becomes a keyrole

In [5]:
# install Pandas
!pip install pandas

Requirement already satisfied: pandas in c:\users\davea\anaconda3\lib\site-packages (1.2.4)
Requirement already satisfied: numpy>=1.16.5 in c:\users\davea\anaconda3\lib\site-packages (from pandas) (1.20.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\davea\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in c:\users\davea\anaconda3\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: six>=1.5 in c:\users\davea\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [6]:
import numpy as np
import pandas as pd

In [7]:
# when we use statistical operations like central tendency parameters....Numpy is required, So numpy is ompotrtant in Pandas.
# even for hypothesis numpy is required

In [8]:
# Delimited values like comma (,) other formats pandas works well
# in case of csv format, delimted value is comma (,)

In [9]:
# The core abstraction layer in pandas is DataFrames
# DataFrames are created with a set of series elements

In [10]:
# In pandas basically we will encounter DataFrmes and series in genreal.
# should be known what is DataFrame and series?

In [11]:
# Creating a DataFrame
# 2 methods are there
# 1. Use a collection of objects (lists, dictionaries and Numpy)
# 2. Using file

In [12]:
# Creating a DF using list
empList = [[1,"Aravind",400000],[2,"Sharada",300000],[3,"Aaradhya",200000],[4,"Abhishek",150000],[5,"Aounnathya",100000]]

In [13]:
empList

[[1, 'Aravind', 400000],
 [2, 'Sharada', 300000],
 [3, 'Aaradhya', 200000],
 [4, 'Abhishek', 150000],
 [5, 'Aounnathya', 100000]]

In [14]:
print(empList)

[[1, 'Aravind', 400000], [2, 'Sharada', 300000], [3, 'Aaradhya', 200000], [4, 'Abhishek', 150000], [5, 'Aounnathya', 100000]]

In [15]:
# # creation of DF using pandas
empDataList = pd.DataFrame(empList)

In [16]:
empDataList

   0           1       2
0  1     Aravind  400000
1  2     Sharada  300000
2  3    Aaradhya  200000
3  4    Abhishek  150000
4  5  Aounnathya  100000

In [17]:
type(empDataList)

pandas.core.frame.DataFrame

In [18]:
# Dataframe contains two types of indexes
# 1. column index and 2. Row index
# # assign column names to the list 
empDataList.columns = ["Eid","Ename","Esalary"]

In [19]:
empDataList

   Eid       Ename  Esalary
0    1     Aravind   400000
1    2     Sharada   300000
2    3    Aaradhya   200000
3    4    Abhishek   150000
4    5  Aounnathya   100000

In [20]:
empDataList1 = pd.DataFrame(empList, columns= ["Eid","Ename","Esalary"])

In [21]:
empDataList1

   Eid       Ename  Esalary
0    1     Aravind   400000
1    2     Sharada   300000
2    3    Aaradhya   200000
3    4    Abhishek   150000
4    5  Aounnathya   100000

In [22]:
# exact index should be mentioned

In [23]:
# DtaFrame is the official name of table in pandas. end of the story :-)

In [24]:
 # According to oops, DataFrame is the class which extracts the homogeneous data

In [25]:
empDataList.info

<bound method DataFrame.info of    Eid       Ename  Esalary
0    1     Aravind   400000
1    2     Sharada   300000
2    3    Aaradhya   200000
3    4    Abhishek   150000
4    5  Aounnathya   100000>

In [26]:
empDataList.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Eid      5 non-null      int64
 1   Ename    5 non-null      object
 2   Esalary  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [27]:
# In pandas , anything other than numeric is an object
# as per pythonic paradigm, string and objects both are same.

In [28]:
# row index is the range index

In [29]:
empList1 = [[1,"Aravind",400000],[2,"Sharada",300000],[3,"Aaradhya",200000],[4,"Abhishek",150000],[5,"Aounnathya",]]

In [30]:
empList1

[[1, 'Aravind', 400000],
 [2, 'Sharada', 300000],
 [3, 'Aaradhya', 200000],
 [4, 'Abhishek', 150000],
 [5, 'Aounnathya']]

In [31]:
empDataList2 = pd.DataFrame(empList1, columns= ["Eid","Ename","Esalary"])

In [32]:
empDataList2

   Eid       Ename   Esalary
0    1     Aravind  400000.0
1    2     Sharada  300000.0
2    3    Aaradhya  200000.0
3    4    Abhishek  150000.0
4    5  Aounnathya       NaN

In [33]:
# NaN is not a number

In [34]:
np.nan

nan

In [35]:
empDataList1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Eid      5 non-null      int64
 1   Ename    5 non-null      object
 2   Esalary  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [36]:
empList2 = [[1,"Aravind",400000],[2,"Sharada",300000],[3,"Aaradhya",200000],[4,"Abhishek",150000],[5,"Aounnathya",],[6, " ", 12000]]

In [37]:
empList2

[[1, 'Aravind', 400000],
 [2, 'Sharada', 300000],
 [3, 'Aaradhya', 200000],
 [4, 'Abhishek', 150000],
 [5, 'Aounnathya'],
 [6, ' ', 12000]]

In [38]:
empDataList3= pd.DataFrame(empList2, columns= ["Eid","Ename","Esalary"])

In [39]:
empDataList3

   Eid       Ename   Esalary
0    1     Aravind  400000.0
1    2     Sharada  300000.0
2    3    Aaradhya  200000.0
3    4    Abhishek  150000.0
4    5  Aounnathya       NaN
5    6               12000.0

In [40]:
# the above data is having 1 nan value in esalary and 1 empty value in ename

In [41]:
# empty value in ename be corrected as NaN

In [42]:
empList3 = [[1,"Aravind",400000],[2,"Sharada",300000],[3,"Aaradhya",200000],[4,"Abhishek",150000],[5,"Aounnathya",],[6,np.nan, 12000]]

In [43]:
empList3

[[1, 'Aravind', 400000],
 [2, 'Sharada', 300000],
 [3, 'Aaradhya', 200000],
 [4, 'Abhishek', 150000],
 [5, 'Aounnathya'],
 [6, nan, 12000]]

In [44]:
empDataList4= pd.DataFrame(empList3, columns= ["Eid","Ename","Esalary"])

In [45]:
empDataList4

   Eid       Ename   Esalary
0    1     Aravind  400000.0
1    2     Sharada  300000.0
2    3    Aaradhya  200000.0
3    4    Abhishek  150000.0
4    5  Aounnathya       NaN
5    6         NaN   12000.0

In [46]:
# how to read NaN values, 
# 1 NaN value in ename and 1 NaN value in Esalary

In [47]:
empDataList4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Eid      6 non-null      int64
 1   Ename    5 non-null      object
 2   Esalary  5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 272.0+ bytes

In [48]:
# How to read above data
# Range index is row index, which is having 6 entries from 0 to 5
# Column entries 3
# Observe the NUll values (NaN) in the columns
# Ename has 1 NaN
# Esalary has 1NaN
# did you understand HOW info is eye balling the missing value
# this is more like eye balling

In [49]:
# the above function is interpretation of data

In [50]:
# The above is based on the list

# Creating DF from file (Delimited file)

In [51]:
# Delimited refers to how column values are seperated
# which ASCII character is used to seperate column data
# CSV-- comma seperated values (,)
# TSV-- tab seperated values (\t)
# PSV--pipe seperated values (|)--not used in market, they say Pi seperated values
# SSV--Semi colan seperated values (;)
# The above format values are depends on the user/Data provider
# assume that data is Fetching/ extracting from the IOT Device ,
# In the IOT micro controller, they coded to seperate columns based on Pi
# should understand, in which format the data is available

In [52]:
# Pandas will help us to deal with delimited files easily

In [53]:
empData = pd.read_csv("employee.csv")

In [54]:
empData

   1  Aravind  500000
0  2  Sharada  400000
1  3  Rachael  300000
2  4     Dave  200000
3  5    Rhema  100000

In [55]:
# read_csv : even though _csv is there here, it will support all the formats of the files.
# CSV in pandas python typically demands having a header in file, 
# otherwise we need to mention saying header=None

In [56]:
empData = pd.read_csv("employee.csv", header=None)

In [57]:
empData

   0        1       2
0  1  Aravind  500000
1  2  Sharada  400000
2  3  Rachael  300000
3  4     Dave  200000
4  5    Rhema  100000

In [58]:
empData = pd.read_csv("employee.csv", header=None, names = ['Eid','Ename','Esalary'])

In [59]:
empData

   Eid    Ename  Esalary
0    1  Aravind   500000
1    2  Sharada   400000
2    3  Rachael   300000
3    4     Dave   200000
4    5    Rhema   100000

In [60]:
empData1 = pd.read_csv("employee.csv", # path file
                       header=None,    # Defines whether header is there or not
                       names = ['Eid','Ename','Esalary'], # Assign Name of the columns
                      sep = ",") # Informing the seperator value ; defalut sep is ,

In [61]:
empData1

   Eid    Ename  Esalary
0    1  Aravind   500000
1    2  Sharada   400000
2    3  Rachael   300000
3    4     Dave   200000
4    5    Rhema   100000

In [62]:
empData1.head()

   Eid    Ename  Esalary
0    1  Aravind   500000
1    2  Sharada   400000
2    3  Rachael   300000
3    4     Dave   200000
4    5    Rhema   100000

In [63]:
empData1.tail()

   Eid    Ename  Esalary
0    1  Aravind   500000
1    2  Sharada   400000
2    3  Rachael   300000
3    4     Dave   200000
4    5    Rhema   100000

In [64]:
empData1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Eid      5 non-null      int64
 1   Ename    5 non-null      object
 2   Esalary  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [65]:
# Anything end with pandas is dataframe

In [66]:
# the moment we give names , then header will be override by names,
# if you give names, then header is not required

In [67]:
# if comma is there in the data, it will be treated as object , so it will not influence

In [68]:
# any seperator issues will be chased by data provider itself..

In [70]:
# at the microcontroller level
# at API level 
# web API level the data will be controlled with formats.

In [71]:
# CR and LF are control characters or 
# bytecode that can be used to mark a line break in a text file.
# LF = Line Feed ( \n , 0x0A in hexadecimal, 10 in decimal)
#— moves the cursor down to the next line without returning to the beginning of the line

In [72]:
# use CRLF to denote end of line. 
# core. eol = lf When Git needs to change line endings to write
# a file in your working directory it will always use LF to denote end of line

In [73]:
 # CRLF and LF both consider as \n ?
 # Yes

In [75]:
# when you work with the data, data information must be there from data team,
# otherwise how will work with the data
# Data information is important and need to check before start working

In [76]:
# can we name the row header too? similar as columns; Yes

In [77]:
# to see intellisense 
# press tab
# eg. pd.arr..then press tab for intellisense

In [80]:
# in general, to extract the data from the APIs, 
# we need to use webscapping methods like beautiful soap
# whatever method we use to get the data
# we can give it to pandas with output of webscapping 
# with codes to identify the seperator value
# and then load it into pandas

In [81]:
# with pandas we can not do webscrapping

In [82]:
# here we html to read
pd.read_html # but very complex to use
# this method is not recommended, instead can be used Beatiful soap, 
# process the data, get the data, store at one place then use it with pandas to load the data

<function pandas.io.html.read_html(io: Union[ForwardRef('PathLike[str]'), str, IO[~T], io.RawIOBase, io.BufferedIOBase, io.TextIOBase, _io.TextIOWrapper, mmap.mmap], match: Union[str, Pattern] = '.+', flavor: Union[str, NoneType] = None, header: Union[int, Sequence[int], NoneType] = None, index_col: Union[int, Sequence[int], NoneType] = None, skiprows: Union[int, Sequence[int], slice, NoneType] = None, attrs: Union[Dict[str, str], NoneType] = None, parse_dates: bool = False, thousands: Union[str, NoneType] = ',', encoding: Union[str, NoneType] = None, decimal: str = '.', converters: Union[Dict, NoneType] = None, na_values=None, keep_default_na: bool = True, displayed_only: bool = True) -> List[pandas.core.frame.DataFrame]>

In [83]:
# then load for analysis..is a good idea.

In [84]:
# Softwares are there for Webscraping, which return data in xlsx or other formats.
# That can be passed to pandas
# beautiful soup and scrapy?
# scrapy is easy to use if you ask which one is best
# if you are good at selenium, then is a good approach for data extraction
# Uipath also can be used for webscapping
# RPI also can be used

In [85]:
# what is Uipath? 
# RPA is Uipath
# Uipath is a software wwhich will help us to perform robotic operations 0f automation.
# We can automate the process of repetative task that need to perform
# RPA is the concept and UPI Path is the software

In [86]:
# using remote access , we can load the load in to pandas
# https://gist.githubusercontent.com/curran/a08a1080b88344b0c8a7/raw/639388c2cbc2120a14dcf466e85730eb8be498bb/iris.csv
# if there is no security instruction, then accesing the data with remote access is easy
# observe the data is with comma seperated values
# this is iris dataset

In [88]:
irisDataFromRemote = pd.read_csv("https://gist.githubusercontent.com/curran/a08a1080b88344b0c8a7/raw/639388c2cbc2120a14dcf466e85730eb8be498bb/iris.csv")

In [89]:
irisDataFromRemote

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [90]:
irisDataFromRemote.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [91]:
# memory usage is 6+KB 
# now this data is in the system memory
# Remember Pandas are etremeely memory intensive

In [92]:
# focus more on security part and what kind of format data in available
# when you are laoding the data from remote/internet

In [93]:
irisDataFromRemote.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [95]:
irisDataFromRemote.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [96]:
irisDataFromRemote.head(10)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [97]:
# like in SQL, top, here .head() function is used to retrive thr data 
# head and tail functions are used to retrieve first and last records
# which is same as in linux